README.md
```mermaid
sequenceDiagram
    title L402 : Service authorization flow

    actor C as Client
    participant CNode as Client Node
    participant Auth as Authorization Server
    participant SNode as Auth Server Node
    participant Res as Resource

    alt First time user
        C ->> Auth: PUT /
        activate Auth
        Auth ->> SNode: Create invoice
        activate SNode
        SNode -->> Auth: Invoice
        deactivate SNode
        Auth ->> Auth: Mint token + invoice
        Auth -->> C: 402: Payment Required, token + invoice
        deactivate Auth
        C ->> CNode: Send payment
        CNode ->> SNode: Send payment
        activate SNode
        SNode -->> CNode: Preimage
        deactivate SNode
        CNode -->> C: Preimage
    else User with a token
        C ->> Auth: GET /protected, token + preimage
        activate Auth
        Auth ->> Res:
        activate Res
        Res ->> Res: Check token, validate caveats
        Res -->> Auth: Protected
        deactivate Res
        Auth -->> C:
        deactivate Auth
    end
```
