docs/Authorization.puml
@startuml Authorization Flow
title L402 : Service authorization flow

hide stereotype
hide empty members
hide footbox

actor Client as C
participant "Client Node" as CNode #B9A898
participant "Authorization Server" as Auth
participant "Auth Server Node" as SNode  #B9A898
participant "Resource" as Res #e06666

alt First time user
  C -> Auth: GET /
  activate Auth
    Auth -> Auth: Check token, not found
    Auth -> SNode: Create invoice
    activate SNode
      Auth <-- SNode: Invoice
    deactivate SNode
    Auth -> Auth: Mint token + invoice
    C <-- Auth: 402: Payment Required, token + invoice
  deactivate Auth
  C -> CNode: Send payment
  CNode -> SNode: Send payment
  activate SNode
    CNode <-- SNode: Preimage
  deactivate SNode
  C <-- CNode: Preimage

else User with a token
  C -> Auth: GET /protected, token + preimage
  activate Auth
    Auth -> Res
    activate Res
      Res -> Res: Check token, validate caveats
      Auth <-- Res: Protected
    deactivate Res
    C <- Auth
  deactivate Auth

end

@enduml
